app/Controllers/Dashboard.php

    public function index()
    {
        $model = new LaporanModel();
        $data['laporan'] = $model->findAll();
---
SELECT *
FROM `laporan`

    public function admin()
    {
        $model = new LaporanModel();
        $data['laporan'] = $model->findAll();
---
SELECT *
FROM `laporan`